---
kind: other
id: Properties.T:Autodesk.Revit.DB.ReferenceWithContext
source: html/b055a651-1336-6475-5303-eb9c227a377e.htm
---
# ReferenceWithContext Properties

Specifies whether the .NET object represents a valid Revit entity.